{"backend": "tensorflow", "config": {"name": "sequential_2", "layers": [{"config": {"bias_regularizer": null, "use_bias": true, "filters": 32, "kernel_regularizer": null, "batch_input_shape": [null, 50, 50, 3], "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "activation": "linear", "dilation_rate": [1, 1], "name": "conv2d_5", "padding": "same", "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "use_bias": true, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1, 1], "name": "conv2d_6", "padding": "valid", "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 512, "name": "dense_3", "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_5", "noise_shape": null, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 41, "name": "dense_4", "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_10"}, "class_name": "Activation"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}